[{"url": "https://www.themoscowtimes.com/2024/12/03/putin-ally-says-russia-will-likely-reject-trumps-ukraine-deal-a87207", "crawled_from": "The Moscow Times", "title": "Putin Ally Says Russia Will Likely Reject Trump’s Ukraine Deal", "description": "Russian President Vladimir Putin will likely reject U.S.", "language": "English", "datePublished": "2024-12-03T13:39:15+03:00", "dateModified": "2024-12-08T20:14:21+03:00", "content": "Dear readers, We are facing unprecedented challenges. Russia's Prosecutor General's Office has designated The Moscow Times as an \"undesirable\" organization, criminalizing our work and putting our staff at risk of prosecution. This follows our earlier unjust labeling as a \"foreign agent.\" These actions are direct attempts to silence independent journalism in Russia. The authorities claim our work \"discredits the decisions of the Russian leadership.\" We see things differently: we strive to provide accurate, unbiased reporting on Russia. We, the journalists of The Moscow Times, refuse to be silenced. But to continue our work,  .  It's quick to set up, and every contribution makes a significant impact. By supporting The Moscow Times, you're defending open, independent journalism in the face of repression. Thank you for standing with us.", "publisher": {"name": "The Moscow Times", "logo": "https://static.themoscowtimes.com/img/logo.png"}, "author": "The Moscow Times", "images": ["https://static.themoscowtimes.com/image/og/14/87207__145404f0367d7fb26eb064b1e7a07685.jpg"], "keywords": ["Ukraine war,Peace Talks,Putin,Trump"]},
{"url": "https://www.themoscowtimes.com/2024/12/03/russia-iran-turkey-qatar-eye-talks-on-syria-rebel-offensive-reports-a87210", "crawled_from": "The Moscow Times", "title": "Russia, Iran, Turkey, Qatar Eye Talks on Syria Rebel Offensive – Reports", "description": "The foreign ministers of Russia, Iran, Turkey and Qatar could meet next week to address the recent escalation in Syria, where an Islamist-led rebel alliance seized territory from the control of President Bashar al-Assad's government in a lightning offensive.", "language": "English", "datePublished": "2024-12-03T14:43:21+03:00", "dateModified": "2024-12-08T20:07:11+03:00", "content": "Dear readers, We are facing unprecedented challenges. Russia's Prosecutor General's Office has designated The Moscow Times as an \"undesirable\" organization, criminalizing our work and putting our staff at risk of prosecution. This follows our earlier unjust labeling as a \"foreign agent.\" These actions are direct attempts to silence independent journalism in Russia. The authorities claim our work \"discredits the decisions of the Russian leadership.\" We see things differently: we strive to provide accurate, unbiased reporting on Russia. We, the journalists of The Moscow Times, refuse to be silenced. But to continue our work,  .  It's quick to set up, and every contribution makes a significant impact. By supporting The Moscow Times, you're defending open, independent journalism in the face of repression. Thank you for standing with us.", "publisher": {"name": "The Moscow Times", "logo": "https://static.themoscowtimes.com/img/logo.png"}, "author": "The Moscow Times", "images": ["https://static.themoscowtimes.com/image/og/42/87210__427a25821ba7a31825cc4bf26ace6aef.jpg"], "keywords": ["Syria,Iran,Turkey,Qatar"]},
{"url": "https://www.themoscowtimes.com/2024/12/03/danish-brewer-carlsberg-sells-russian-business-a87213", "crawled_from": "The Moscow Times", "title": "Danish Brewer Carlsberg Sells Russian Business", "description": " Danish brewer Carlsberg announced Tuesday an agreement to sell its shares in its Russian unit, a day after President Vladimir Putin signed a decree ending state control of the business.", "language": "English", "datePublished": "2024-12-03T15:31:24+03:00", "dateModified": "2024-12-08T20:14:21+03:00", "content": "Danish brewer Carlsberg announced Tuesday an agreement to sell its shares in its Russian unit, a day after President Vladimir Putin signed a decree ending state control of the business. Carlsberg, like many other Western firms, had announced in March 2022 that it would leave Russia, where it employed 8,400 people, following Moscow's invasion of Ukraine. But a year later, Putin placed Carlsberg's local unit, Baltika Breweries, under state management and the Danish firm's chief executive, Jacob Aarup-Andersen, declared that its Russian business had been \"stolen.\" With Putin ending state control over Baltika, Carlsberg said in a statement on Tuesday that it had an agreement to sell its shares in the local company for an undisclosed \"cash consideration.\" Carlsberg will also receive Baltika's shareholdings in Carlsberg Azerbaijan and Carlsberg Kazakhstan. \"The new controlling shareholder of Baltika Breweries will be a company owned equally by two longstanding Baltika employees, currently holding leading positions in the company,\" the statement said. The transaction is expected to close \"within the next couple of days.\" \"Since the announcement of our intention to leave Russia in 2022, we have exhausted all options to find a way to achieve a full exit from Russia while protecting our employees, our assets and the value of the Carlsberg business,\" Aarup-Andersen said in the statement. He said the sale would settle \"numerous lawsuits\" and intellectual property rights issues. \"Considering the circumstances, we believe it is the best achievable outcome for our employees, shareholders and the continued business,\" the CEO said. Dear readers, We are facing unprecedented challenges. Russia's Prosecutor General's Office has designated The Moscow Times as an \"undesirable\" organization, criminalizing our work and putting our staff at risk of prosecution. This follows our earlier unjust labeling as a \"foreign agent.\" These actions are direct attempts to silence independent journalism in Russia. The authorities claim our work \"discredits the decisions of the Russian leadership.\" We see things differently: we strive to provide accurate, unbiased reporting on Russia. We, the journalists of The Moscow Times, refuse to be silenced. But to continue our work,  .  It's quick to set up, and every contribution makes a significant impact. By supporting The Moscow Times, you're defending open, independent journalism in the face of repression. Thank you for standing with us.", "publisher": {"name": "The Moscow Times", "logo": "https://static.themoscowtimes.com/img/logo.png"}, "author": "AFP", "images": ["https://static.themoscowtimes.com/image/og/da/87213__dae5532a05fbaf1d132da5474c74b448.jpg"], "keywords": ["business"]},
{"url": "https://www.themoscowtimes.com/2024/12/03/us-charges-russian-woman-over-fsb-contacts-reports-a87211", "crawled_from": "The Moscow Times", "title": "U.S. Charges Russian Woman Over FSB Contacts – Reports", "description": "The United States has charged a Russian woman who engaged with anti-war opposition activists over false statements about her ties with Russia’s Federal Security Service (FSB), a U.S.-based non-profit of pro-democracy Russians said Monday.", "language": "English", "datePublished": "2024-12-03T16:18:18+03:00", "dateModified": "2024-12-08T20:14:21+03:00", "content": "Dear readers, We are facing unprecedented challenges. Russia's Prosecutor General's Office has designated The Moscow Times as an \"undesirable\" organization, criminalizing our work and putting our staff at risk of prosecution. This follows our earlier unjust labeling as a \"foreign agent.\" These actions are direct attempts to silence independent journalism in Russia. The authorities claim our work \"discredits the decisions of the Russian leadership.\" We see things differently: we strive to provide accurate, unbiased reporting on Russia. We, the journalists of The Moscow Times, refuse to be silenced. But to continue our work,  .  It's quick to set up, and every contribution makes a significant impact. By supporting The Moscow Times, you're defending open, independent journalism in the face of repression. Thank you for standing with us.", "publisher": {"name": "The Moscow Times", "logo": "https://static.themoscowtimes.com/img/logo.png"}, "author": "The Moscow Times", "images": ["https://static.themoscowtimes.com/image/og/4d/87211__4dc126fd18f3004f97be89dcca90588a.jpg"], "keywords": [""]},
{"url": "https://www.themoscowtimes.com/2024/12/03/russia-says-test-fired-missiles-in-eastern-mediterranean-drills-a87218", "crawled_from": "The Moscow Times", "title": "Russia Says Test-Fired Missiles in Eastern Mediterranean Drills", "description": " Russia's army said Tuesday it had fired hypersonic missiles during naval and Air Force drills in the eastern Mediterranean that come as its ally Syria loses ground to Islamist rebels.", "language": "English", "datePublished": "2024-12-03T18:08:30+03:00", "dateModified": "2024-12-08T20:14:21+03:00", "content": "Russia's army said Tuesday it had fired hypersonic missiles during naval and Air Force drills in the eastern Mediterranean that come as its ally Syria loses ground to Islamist rebels. The military said the number of Russian troops stationed in the region had been \"increased\" to take part in the exercises. Russia has been carrying out air strikes in recent days to try to counter a rebel offensive that has seen President Bashar al-Assad's forces lose the second city of Aleppo. Moscow has been a key ally of Assad since the Syrian civil war started in 2011. \"On 3 December, during an exercise to test the combined activities of Russian Navy and Air Force troop groups, precision sea-based missiles were launched in the eastern part of the Mediterranean Sea,\" Russia's Defense Ministry said in a post on Telegram. Russian vessels test-fired hypersonic Zirkon missiles and a Kalibr cruise missile, the ministry added. An Onyx cruise missile was launched \"from a designated area on the Mediterranean coast,\" it added. Russia has a naval base in Syria at Tartus but the statement did not say where the drills were carried out. \"In the course of preparing for the exercise, the Russian Armed Forces' troops grouping in the eastern Mediterranean was increased,\" the ministry added. More than 1,000 forces, 10 vessels and 24 aircraft were taking part in the drills, it said. The ministry   images showing the launch of several missiles from ships and land and images of a target in open water being hit and exploding. Dear readers, We are facing unprecedented challenges. Russia's Prosecutor General's Office has designated The Moscow Times as an \"undesirable\" organization, criminalizing our work and putting our staff at risk of prosecution. This follows our earlier unjust labeling as a \"foreign agent.\" These actions are direct attempts to silence independent journalism in Russia. The authorities claim our work \"discredits the decisions of the Russian leadership.\" We see things differently: we strive to provide accurate, unbiased reporting on Russia. We, the journalists of The Moscow Times, refuse to be silenced. But to continue our work,  .  It's quick to set up, and every contribution makes a significant impact. By supporting The Moscow Times, you're defending open, independent journalism in the face of repression. Thank you for standing with us.", "publisher": {"name": "The Moscow Times", "logo": "https://static.themoscowtimes.com/img/logo.png"}, "author": "AFP", "images": ["https://static.themoscowtimes.com/image/og/49/87218__49fa999b52e754c07a4fa9ca01276859.jpg"], "keywords": ["Defense Ministry,Syria"]},
{"url": "https://www.themoscowtimes.com/2024/12/03/georgia-pm-vows-retribution-for-protests-as-court-rejects-bid-to-annul-vote-a87204", "crawled_from": "The Moscow Times", "title": "Georgian PM Vows Retribution for Protests as Court Rejects Bid to Annul Vote", "description": " Georgia's prime minister on Tuesday threatened to punish his political opponents, accusing them of being behind violence at mass protests, as Tbilisi's top court rejected a key lawsuit to annul the result of a contested October vote.", "language": "English", "datePublished": "2024-12-03T13:59:00+03:00", "dateModified": "2024-12-08T20:14:21+03:00", "content": "Georgia's prime minister on Tuesday threatened to punish his political opponents, accusing them of being behind violence at mass protests, as Tbilisi's top court rejected a key lawsuit to annul the result of a contested October vote. Prime Minister Irakli Kobakhidze — who infuriated protesters last week by announcing his government would shelve EU accession talks until 2028 — also suggested he would take retribution on public servants if they take part in protests. Thousands of demonstrators took to the streets on Monday against the ruling Georgian Dream party in a fifth straight night of protests, with more demonstrations planned on Tuesday. They accuse the government of bringing Tbilisi back into Moscow's orbit and betraying the Black Sea nation's bid for EU membership, which is enshrined in its constitution and supported by around 80 percent of the population. Georgia has been gripped by political turmoil since a contested October election, which pro-EU President Salome Zurabishvili and the opposition say Georgian Dream rigged, demanding a re-run. But, intensifying the crisis, Tbilisi's top court on Tuesday rejected a lawsuit filed by Zurabishvili and opposition parties to overturn the election result. A re-run of the contested vote was one of the protestors' main demands. Zurabishvili, who backs the protests and whom Georgian Dream is trying to remove from office, has not yet responded to the court's decision to throw out her case. That announcement came shortly after Kobakhidze — who has ruled out talks with the opposition — vowed to punish his opponents. \"Opposition politicians who have orchestrated the violence in recent days while hiding in their offices will not escape responsibility,\" he said at a press conference. The ruling Georgian Dream party has refused to back down despite increasing international criticism of Georgia's handling of its protests, with several Western countries saying Tbilisi had used excessive force. Kobakhidze, 46, also threatened to punish civil servants who join the protests, after several ambassadors and a deputy foreign minister resigned over the demonstration crackdown and his decision to suspend EU talks. \"The process of self-cleansing within the public sector has been very interesting. We are closely monitoring everyone's actions, and they will not go without a response,\" he said. Evoking language used by the Kremlin, Kobakhidze alleged the protest movement was \"funded from abroad.\" He also singled out NGOs — heavily targeted in a repressive pre-election campaign by authorities — for being behind the protests, vowing that they will \"not evade responsibility as defined by law.\" Tbilisi earlier this year adopted Russian-style legislation designed to restrict the activity of NGOs as well measures that the EU says curb LGBTQ+ rights. The adoption of the laws prompted the U.S. to slap sanctions on Georgian officials. But Kobakhidze said his government hoped that the \"U.S. attitudes towards us will change after January 20\" — when Donald Trump, who has criticized federal support for gender transition, takes office. Kobakhidze's threats to the opposition came as more Western leaders criticized Tbilisi's police response to the protests. NATO chief Mark Rutte on Tuesday slammed as \"deeply concerning\" the situation in Georgia, condemning \"unequivocally\" the reports of violence. The mostly young protesters accuse Georgian Dream of acting on Russian orders and fear the ex-Soviet country will end up back under Russian influence. \"We want freedom and we do not want to find ourselves in Russia,\" 21-year-old protester Nika Maghradze, told AFP. Georgia's health ministry earlier said that 26 people — 23 protesters and three law enforcement officers — were injured in the latest protest on Monday night. President Zurabishvili has described the protests as Georgians \"rising against the Russian puppetry regime.\" \"The message is clear: Give me my vote back! Give me my European future back!\" she had said on social media on Monday. Some protesters placed their hopes in the 72-year-old president. \"She is our only chance,\" 43-year-old demonstrator Mariam told AFP on Monday. Dear readers, We are facing unprecedented challenges. Russia's Prosecutor General's Office has designated The Moscow Times as an \"undesirable\" organization, criminalizing our work and putting our staff at risk of prosecution. This follows our earlier unjust labeling as a \"foreign agent.\" These actions are direct attempts to silence independent journalism in Russia. The authorities claim our work \"discredits the decisions of the Russian leadership.\" We see things differently: we strive to provide accurate, unbiased reporting on Russia. We, the journalists of The Moscow Times, refuse to be silenced. But to continue our work,  .  It's quick to set up, and every contribution makes a significant impact. By supporting The Moscow Times, you're defending open, independent journalism in the face of repression. Thank you for standing with us.", "publisher": {"name": "The Moscow Times", "logo": "https://static.themoscowtimes.com/img/logo.png"}, "author": "Lea Dauple for AFP", "images": ["https://static.themoscowtimes.com/image/og/74/87204__743f07e24d92c7693ffe8009689e52cd.jpg"], "keywords": ["Georgia,Protest"]},
{"url": "https://www.themoscowtimes.com/2024/12/03/russia-fines-italian-citizen-for-rainbow-peace-flag-near-kremlin-a87216", "crawled_from": "The Moscow Times", "title": "Russia Fines Italian Citizen for Rainbow Peace Flag Near Kremlin", "description": "An Italian citizen was fined under Russia’s wartime censorship laws for displaying a rainbow peace flag near the Kremlin in Moscow, the independent news website Mediazona reported Tuesday, citing a court ruling.", "language": "English", "datePublished": "2024-12-03T18:11:21+03:00", "dateModified": "2024-12-08T20:14:21+03:00", "content": "Dear readers, We are facing unprecedented challenges. Russia's Prosecutor General's Office has designated The Moscow Times as an \"undesirable\" organization, criminalizing our work and putting our staff at risk of prosecution. This follows our earlier unjust labeling as a \"foreign agent.\" These actions are direct attempts to silence independent journalism in Russia. The authorities claim our work \"discredits the decisions of the Russian leadership.\" We see things differently: we strive to provide accurate, unbiased reporting on Russia. We, the journalists of The Moscow Times, refuse to be silenced. But to continue our work,  .  It's quick to set up, and every contribution makes a significant impact. By supporting The Moscow Times, you're defending open, independent journalism in the face of repression. Thank you for standing with us.", "publisher": {"name": "The Moscow Times", "logo": "https://static.themoscowtimes.com/img/logo.png"}, "author": "The Moscow Times", "images": ["https://static.themoscowtimes.com/image/og/d6/87216__d68bb1f0fb85633dd36522959be89149.jpg"], "keywords": ["Protest,Moscow,Kremlin"]},
{"url": "https://www.themoscowtimes.com/2024/12/03/kyiv-says-repelled-russian-push-over-east-ukrainian-river-a87217", "crawled_from": "The Moscow Times", "title": "Kyiv Says Repelled Russian Push Over East Ukrainian River", "description": " Ukraine said Tuesday that its forces had repelled a Russian effort to cross a key waterway on the eastern frontline, as Moscow's army claimed to have seized two more villages in its grinding advance.", "language": "English", "datePublished": "2024-12-03T17:20:04+03:00", "dateModified": "2024-12-08T20:14:21+03:00", "content": "Ukraine said Tuesday that its forces had repelled a Russian effort to cross a key waterway on the eastern frontline, as Moscow's army claimed to have seized two more villages in its grinding advance. Almost three years after invading, Russia's forces are accelerating their offensive, capturing more Ukrainian territory in November than in any month since March 2022, according to AFP analysis of data from the US Institute for the Study of War. Kyiv said Russian forces had tried to cross the Oskil River, which has long been a de facto front line across the east of the war-scarred country. The waterway winds its way from Russia's western border through the northeast of Ukraine, with Moscow and Kyiv's forces entrenched on either side of sections of its banks. \"As a result of the successful operation, the enemy was destroyed. The right bank of the Oskil River is under the control of the Defense Forces,\" the Ukrainian military said in a statement. Ukrainian military bloggers had over recent days reported a Russian push over the river near the village of Novomlynsk in the northeastern Kharkiv region. Moscow's forces have been advancing in the Kharkiv region, which borders Russia, and are closing in on the civilian hub of Kupiansk, which is divided by the Oskil River. Kupiansk had a pre-war population of around 27,000 people and was occupied by Russian forces just days after the Kremlin launched its invasion, when the town's mayor ceded control. Ukraine recaptured it in September 2022 as part of a lightning offensive that saw them regain large swathes of the Kharkiv region. Russia's forces claimed separately on Tuesday to have advanced along the eastern and southern fronts. The defense ministry said its troops had seized the villages of Novodarivka in the southern Zaporizhzhia region and Romanivka in the eastern Donetsk region. It also claimed to have \"improved its tactical position\" in the northeastern Kharkiv region, including around Kupiansk, though it did not comment on the alleged attempt to cross the river. Russia's troops have stepped up their advances on the front line, combined with an escalation in aerial attacks on Ukrainian cities and energy facilities. An AFP analysis of ISW data showed that during November, Kremlin forces advanced on more than 725 square kilometers (280 square miles) of Ukrainian territory, mainly in the east near the city of Pokrovsk, compared with an advance of 610 square kilometers in October. Separate Russian artillery and drone attacks killed three people in the eastern Donetsk region, including in the under-fire city of Pokrovsk, a key Russian target, the local Governor Vadym Filashkin said. Dear readers, We are facing unprecedented challenges. Russia's Prosecutor General's Office has designated The Moscow Times as an \"undesirable\" organization, criminalizing our work and putting our staff at risk of prosecution. This follows our earlier unjust labeling as a \"foreign agent.\" These actions are direct attempts to silence independent journalism in Russia. The authorities claim our work \"discredits the decisions of the Russian leadership.\" We see things differently: we strive to provide accurate, unbiased reporting on Russia. We, the journalists of The Moscow Times, refuse to be silenced. But to continue our work,  .  It's quick to set up, and every contribution makes a significant impact. By supporting The Moscow Times, you're defending open, independent journalism in the face of repression. Thank you for standing with us.", "publisher": {"name": "The Moscow Times", "logo": "https://static.themoscowtimes.com/img/logo.png"}, "author": "AFP", "images": ["https://static.themoscowtimes.com/image/og/52/87217__52b49ccde03648e34f242fd0cc1893cd.jpg"], "keywords": ["Ukraine war"]},
{"url": "https://www.themoscowtimes.com/2024/12/04/tucker-carlson-interviews-russian-fm-lavrov-in-moscow-a87222", "crawled_from": "The Moscow Times", "title": "Tucker Carlson Interviews Russian FM Lavrov in Moscow", "description": "U.S. conservative talk show host Tucker Carlson said Wednesday he had returned to Russia for a “fascinating” interview with Foreign Minister Sergei Lavrov about the possibility of nuclear war. “Are we headed toward an unprecedented conflict between Russia and the United States?” Carlson said in a video outside the Kremlin promoting his interview, which he said would air “very soon.” “Is there any way to peel Russia back from the East, from the sphere of [influence of] China, back into the West?", "language": "English", "datePublished": "2024-12-04T12:51:00+03:00", "dateModified": "2024-12-08T20:12:11+03:00", "content": "Dear readers, We are facing unprecedented challenges. Russia's Prosecutor General's Office has designated The Moscow Times as an \"undesirable\" organization, criminalizing our work and putting our staff at risk of prosecution. This follows our earlier unjust labeling as a \"foreign agent.\" These actions are direct attempts to silence independent journalism in Russia. The authorities claim our work \"discredits the decisions of the Russian leadership.\" We see things differently: we strive to provide accurate, unbiased reporting on Russia. We, the journalists of The Moscow Times, refuse to be silenced. But to continue our work,  .  It's quick to set up, and every contribution makes a significant impact. By supporting The Moscow Times, you're defending open, independent journalism in the face of repression. Thank you for standing with us.", "publisher": {"name": "The Moscow Times", "logo": "https://static.themoscowtimes.com/img/logo.png"}, "author": "The Moscow Times", "images": ["https://static.themoscowtimes.com/image/og/7d/87222__7d8d7ef562fb1a90df500a0b705e148b.jpg"], "keywords": ["Lavrov,Nuclear Weapons,Ukraine war"]},
{"url": "https://www.themoscowtimes.com/2024/12/03/exclusive-kremlin-stages-oreshnik-propaganda-blitz-as-nuclear-threats-lose-their-potency-a87206", "crawled_from": "The Moscow Times", "title": "Exclusive: Kremlin Stages Oreshnik Propaganda Blitz as Nuclear Threats Lose Their Potency", "description": "Russia’s unleashing of the Oreshnik experimental ballistic missile on Ukraine was a propaganda operation designed by the Kremlin, the military, and intelligence agencies to reignite fear in Kyiv and Western capitals that had grown accustomed to Moscow’s nuclear saber-rattling.", "language": "English", "datePublished": "2024-12-03T16:39:00+03:00", "dateModified": "2024-12-08T20:14:21+03:00", "content": "Maria Zakharova, Russia's foreign ministry spokeswoman, takes a phone call in the middle of her presser telling her not to comment on Russia's strike on Ukraine with an intercontinental ballistic missile. The caller appears to say the target was the Yuzhmash factory in Dnipro  Gromov was reportedly the person who   Zakharova during a morning briefing with journalists and, on speakerphone,  Dear readers, We are facing unprecedented challenges. Russia's Prosecutor General's Office has designated The Moscow Times as an \"undesirable\" organization, criminalizing our work and putting our staff at risk of prosecution. This follows our earlier unjust labeling as a \"foreign agent.\" These actions are direct attempts to silence independent journalism in Russia. The authorities claim our work \"discredits the decisions of the Russian leadership.\" We see things differently: we strive to provide accurate, unbiased reporting on Russia. We, the journalists of The Moscow Times, refuse to be silenced. But to continue our work,  .  It's quick to set up, and every contribution makes a significant impact. By supporting The Moscow Times, you're defending open, independent journalism in the face of repression. Thank you for standing with us.", "publisher": {"name": "The Moscow Times", "logo": "https://static.themoscowtimes.com/img/logo.png"}, "author": "Moscow Times Reporter", "images": ["https://static.themoscowtimes.com/image/og/7c/87206__7c027fcb862e72e414caa4a1681fdcb0.jpg"], "keywords": ["Ukraine war,Arms,military"]},
{"url": "https://www.themoscowtimes.com/2024/12/04/moscow-says-russia-iran-turkey-in-close-contact-over-syria-conflict-a87225", "crawled_from": "The Moscow Times", "title": "Moscow Says Russia, Iran, Turkey in ‘Close Contact’ Over Syria Conflict", "description": "Russia, Iran and Turkey are in \"close contact\" over the conflict in Syria, Moscow said Wednesday, after a shock offensive has seen Islamist-led rebels capture the second-largest city of Aleppo.", "language": "English", "datePublished": "2024-12-04T14:11:22+03:00", "dateModified": "2024-12-08T20:10:20+03:00", "content": "Russia, Iran and Turkey are in \"close contact\" over the conflict in Syria, Moscow said Wednesday, after a shock offensive has seen Islamist-led rebels capture the second-largest city of Aleppo. \"The foreign ministers of the three guarantor countries — Russia, Iran and Turkey — are in close contact with each other,\" Russian Foreign Ministry spokeswoman Maria Zakharova told reporters on Wednesday. Moscow is a key ally of Syrian President Bashar al-Assad and is supporting his attempts to quash the rebellion with air strikes, while Ankara has historically supported some anti-government forces. Russia and Turkey brokered a 2016 ceasefire between the various rebel groups and Syrian forces, with Iran joining as a \"guarantor state.\" Zakharova said Russia was \"actively working with international partners to ensure the rapid stabilization of the situation in Syria.\" In a phone call on Tuesday, Russian President Vladimir Putin told Turkish President Recep Tayyip Erdogan that the conflict needed a \"speedy end,\" and condemned \"terrorist aggression against the Syrian state. A senior official from the office of Iran's supreme leader was also in Moscow for talks on Wednesday, the Iranian Embassy said in a statement. Russia, which announced naval and air force drills in the eastern Mediterranean this week, has accused Ukraine of backing the Syrian Islamist rebels. At the United Nations on Tuesday, Russia's envoy Vassily Nebenzia said Ukraine had supported the Islamist group Hayat Tahrir al-Sham (HTS) with weapons and instructors, without presenting any evidence. \"Ukrainian military instructors from the GUR are present... training HTS fighters for combat operations,\" including against Russian troops in Syria, said Nebenzia. Dear readers, We are facing unprecedented challenges. Russia's Prosecutor General's Office has designated The Moscow Times as an \"undesirable\" organization, criminalizing our work and putting our staff at risk of prosecution. This follows our earlier unjust labeling as a \"foreign agent.\" These actions are direct attempts to silence independent journalism in Russia. The authorities claim our work \"discredits the decisions of the Russian leadership.\" We see things differently: we strive to provide accurate, unbiased reporting on Russia. We, the journalists of The Moscow Times, refuse to be silenced. But to continue our work,  .  It's quick to set up, and every contribution makes a significant impact. By supporting The Moscow Times, you're defending open, independent journalism in the face of repression. Thank you for standing with us.", "publisher": {"name": "The Moscow Times", "logo": "https://static.themoscowtimes.com/img/logo.png"}, "author": "AFP", "images": ["https://static.themoscowtimes.com/image/og/2c/87225__2c8a557a834267717040ff8438558dd0.jpg"], "keywords": ["Syria"]},
{"url": "https://www.themoscowtimes.com/2024/12/03/abkhazia-votes-to-scrap-russian-investment-deal-after-mass-protests-a87215", "crawled_from": "The Moscow Times", "title": "Abkhazia Votes to Scrap Russian Investment Deal After Mass Protests", "description": "Lawmakers in the Moscow-backed breakaway Georgian region of Abkhazia voted Tuesday to scrap the controversial Russian investment deal that sparked protests and the resignation of its leader.", "language": "English", "datePublished": "2024-12-03T19:10:27+03:00", "dateModified": "2024-12-08T20:14:21+03:00", "content": "Dear readers, We are facing unprecedented challenges. Russia's Prosecutor General's Office has designated The Moscow Times as an \"undesirable\" organization, criminalizing our work and putting our staff at risk of prosecution. This follows our earlier unjust labeling as a \"foreign agent.\" These actions are direct attempts to silence independent journalism in Russia. The authorities claim our work \"discredits the decisions of the Russian leadership.\" We see things differently: we strive to provide accurate, unbiased reporting on Russia. We, the journalists of The Moscow Times, refuse to be silenced. But to continue our work,  .  It's quick to set up, and every contribution makes a significant impact. By supporting The Moscow Times, you're defending open, independent journalism in the face of repression. Thank you for standing with us.", "publisher": {"name": "The Moscow Times", "logo": "https://static.themoscowtimes.com/img/logo.png"}, "author": "The Moscow Times", "images": ["https://static.themoscowtimes.com/image/og/77/87215__77bc1d8ac356eb6543d5c2147a1c8982.jpg"], "keywords": ["Abkhazia,Investment"]},
{"url": "https://www.themoscowtimes.com/2024/12/03/russia-warns-citizens-in-s-korea-to-avoid-mass-events-after-martial-law-declared-a87220", "crawled_from": "The Moscow Times", "title": "Russia Warns Citizens in S. Korea to Avoid ‘Mass Events’ After Martial Law Declared", "description": "Russia's Embassy in South Korea warned its citizens to “refrain” from “mass events” after the country's president declared martial law in a surprise move on Tuesday. “We urge Russian citizens in the Republic of Korea to remain calm, follow the authorities' recommendations, and refrain from participating in mass events, particularly those of a political nature,” the embassy said.", "language": "English", "datePublished": "2024-12-03T19:18:00+03:00", "dateModified": "2024-12-08T20:14:21+03:00", "content": "Dear readers, We are facing unprecedented challenges. Russia's Prosecutor General's Office has designated The Moscow Times as an \"undesirable\" organization, criminalizing our work and putting our staff at risk of prosecution. This follows our earlier unjust labeling as a \"foreign agent.\" These actions are direct attempts to silence independent journalism in Russia. The authorities claim our work \"discredits the decisions of the Russian leadership.\" We see things differently: we strive to provide accurate, unbiased reporting on Russia. We, the journalists of The Moscow Times, refuse to be silenced. But to continue our work,  .  It's quick to set up, and every contribution makes a significant impact. By supporting The Moscow Times, you're defending open, independent journalism in the face of repression. Thank you for standing with us.", "publisher": {"name": "The Moscow Times", "logo": "https://static.themoscowtimes.com/img/logo.png"}, "author": "The Moscow Times", "images": ["https://static.themoscowtimes.com/image/og/45/87220__451af08450a72fa37474b2cd93b08919.jpg"], "keywords": ["South Korea,Foreign Ministry"]},
{"url": "https://www.themoscowtimes.com/2024/12/04/caught-in-riots-georgias-protesters-say-they-must-choose-between-europe-and-russia-a87221", "crawled_from": "The Moscow Times", "title": "Caught in Riots, Georgia’s Protesters Say They Must Choose Between Europe and Russia", "description": "TBILISI, Georgia — Riot police, tear gas and smoke grenades: this is what the streets of the capital of Georgia — a South Caucasus republic at the crossroads of Europe and Asia — look like on the sixth consecutive day of mass protests.", "language": "English", "datePublished": "2024-12-04T14:44:00+03:00", "dateModified": "2024-12-08T20:08:30+03:00", "content": "\"I fear a potential military intervention from Russia if civil unrest intensifies. That would be the scariest thing. I also feel that I'd be partly responsible for this due to my involvement in the protests,\"  Dear readers, We are facing unprecedented challenges. Russia's Prosecutor General's Office has designated The Moscow Times as an \"undesirable\" organization, criminalizing our work and putting our staff at risk of prosecution. This follows our earlier unjust labeling as a \"foreign agent.\" These actions are direct attempts to silence independent journalism in Russia. The authorities claim our work \"discredits the decisions of the Russian leadership.\" We see things differently: we strive to provide accurate, unbiased reporting on Russia. We, the journalists of The Moscow Times, refuse to be silenced. But to continue our work,  .  It's quick to set up, and every contribution makes a significant impact. By supporting The Moscow Times, you're defending open, independent journalism in the face of repression. Thank you for standing with us.", "publisher": {"name": "The Moscow Times", "logo": "https://static.themoscowtimes.com/img/logo.png"}, "author": "Moscow Times Reporter", "images": ["https://static.themoscowtimes.com/image/og/d2/87221__d22ca02606199145252c5684fa306eb7.jpg"], "keywords": ["Georgia,Protest"]},
{"url": "https://www.themoscowtimes.com/2024/12/05/russia-arrests-4-over-deadly-crocus-city-hall-attack-reports-a87230", "crawled_from": "The Moscow Times", "title": "Russia Arrests 4 Over Deadly Crocus City Hall Attack – Reports", "description": "Russian authorities have arrested four suspected accomplices in the deadly concert hall attack near Moscow this spring, state-run media reported Wednesday, citing anonymous sources.", "language": "English", "datePublished": "2024-12-05T00:51:15+03:00", "dateModified": "2024-12-08T20:09:31+03:00", "content": "Dear readers, We are facing unprecedented challenges. Russia's Prosecutor General's Office has designated The Moscow Times as an \"undesirable\" organization, criminalizing our work and putting our staff at risk of prosecution. This follows our earlier unjust labeling as a \"foreign agent.\" These actions are direct attempts to silence independent journalism in Russia. The authorities claim our work \"discredits the decisions of the Russian leadership.\" We see things differently: we strive to provide accurate, unbiased reporting on Russia. We, the journalists of The Moscow Times, refuse to be silenced. But to continue our work,  .  It's quick to set up, and every contribution makes a significant impact. By supporting The Moscow Times, you're defending open, independent journalism in the face of repression. Thank you for standing with us.", "publisher": {"name": "The Moscow Times", "logo": "https://static.themoscowtimes.com/img/logo.png"}, "author": "The Moscow Times", "images": ["https://static.themoscowtimes.com/image/og/55/87230__55568be138ba49cdd386c492e5b341a9.jpg"], "keywords": ["Crocus,Islamic State,Terrorism"]},
{"url": "https://www.themoscowtimes.com/2024/12/04/russias-central-bank-governor-says-likely-rate-hike-not-predetermined-a87224", "crawled_from": "The Moscow Times", "title": "Russia’s Central Bank Governor Says Likely Rate Hike ’Not Predetermined’", "description": "Russia’s Central Bank Governor Elvira Nabiullina said Wednesday the bank would likely raise the key interest rate this month, but the decision is not predetermined due to a recent slowdown in loans.", "language": "English", "datePublished": "2024-12-04T14:12:00+03:00", "dateModified": "2024-12-08T20:14:21+03:00", "content": "Dear readers, We are facing unprecedented challenges. Russia's Prosecutor General's Office has designated The Moscow Times as an \"undesirable\" organization, criminalizing our work and putting our staff at risk of prosecution. This follows our earlier unjust labeling as a \"foreign agent.\" These actions are direct attempts to silence independent journalism in Russia. The authorities claim our work \"discredits the decisions of the Russian leadership.\" We see things differently: we strive to provide accurate, unbiased reporting on Russia. We, the journalists of The Moscow Times, refuse to be silenced. But to continue our work,  .  It's quick to set up, and every contribution makes a significant impact. By supporting The Moscow Times, you're defending open, independent journalism in the face of repression. Thank you for standing with us.", "publisher": {"name": "The Moscow Times", "logo": "https://static.themoscowtimes.com/img/logo.png"}, "author": "The Moscow Times", "images": ["https://static.themoscowtimes.com/image/og/31/87224__317291f2636e3b42fca2e1e02a78dcd0.jpg"], "keywords": ["Central Bank,Inflation,Economy"]},
{"url": "https://www.themoscowtimes.com/2024/12/04/ukraines-kherson-targeted-in-months-long-russian-drone-campaign-ft-a87223", "crawled_from": "The Moscow Times", "title": "Ukraine’s Kherson Targeted in Months-Long Russian Drone Campaign – FT", "description": "Russian attack drones have for months targeted civilians in the southern Ukrainian city of Kherson, in an attempt to empty the city ahead of a possible offensive there, the Financial Times reported Wednesday, citing local officials and residents.", "language": "English", "datePublished": "2024-12-04T14:00:21+03:00", "dateModified": "2024-12-08T20:14:21+03:00", "content": "Dear readers, We are facing unprecedented challenges. Russia's Prosecutor General's Office has designated The Moscow Times as an \"undesirable\" organization, criminalizing our work and putting our staff at risk of prosecution. This follows our earlier unjust labeling as a \"foreign agent.\" These actions are direct attempts to silence independent journalism in Russia. The authorities claim our work \"discredits the decisions of the Russian leadership.\" We see things differently: we strive to provide accurate, unbiased reporting on Russia. We, the journalists of The Moscow Times, refuse to be silenced. But to continue our work,  .  It's quick to set up, and every contribution makes a significant impact. By supporting The Moscow Times, you're defending open, independent journalism in the face of repression. Thank you for standing with us.", "publisher": {"name": "The Moscow Times", "logo": "https://static.themoscowtimes.com/img/logo.png"}, "author": "The Moscow Times", "images": ["https://static.themoscowtimes.com/image/og/db/87223__dbbd44e20db8853630d8103ff8fe4d0e.jpg"], "keywords": ["Kherson,drones,Ukraine war"]},
{"url": "https://www.themoscowtimes.com/2024/12/04/anti-war-russians-targeted-by-fsbs-spy-software-ngo-a87228", "crawled_from": "The Moscow Times", "title": "Anti-War Russians Targeted by FSB’s Spy Software – NGO", "description": "Russia’s Federal Security Service (FSB) spies on anti-war Russians with advanced Android spyware, the legal rights group Perviy Otdel said Wednesday, citing a systems analyst who discovered the surveillance software on his phone.", "language": "English", "datePublished": "2024-12-04T18:26:10+03:00", "dateModified": "2024-12-08T20:14:21+03:00", "content": "Dear readers, We are facing unprecedented challenges. Russia's Prosecutor General's Office has designated The Moscow Times as an \"undesirable\" organization, criminalizing our work and putting our staff at risk of prosecution. This follows our earlier unjust labeling as a \"foreign agent.\" These actions are direct attempts to silence independent journalism in Russia. The authorities claim our work \"discredits the decisions of the Russian leadership.\" We see things differently: we strive to provide accurate, unbiased reporting on Russia. We, the journalists of The Moscow Times, refuse to be silenced. But to continue our work,  .  It's quick to set up, and every contribution makes a significant impact. By supporting The Moscow Times, you're defending open, independent journalism in the face of repression. Thank you for standing with us.", "publisher": {"name": "The Moscow Times", "logo": "https://static.themoscowtimes.com/img/logo.png"}, "author": "The Moscow Times", "images": ["https://static.themoscowtimes.com/image/og/a0/87228__a02c128ba3a933c4e670fa5e1356d547.jpg"], "keywords": ["FSB,spying,Repression"]},
{"url": "https://www.themoscowtimes.com/2024/12/04/russians-cash-savings-reach-all-time-low-vtb-a87227", "crawled_from": "The Moscow Times", "title": "Russians’ Cash Savings Reach All-Time Low – VTB", "description": "Russians’ cash savings have reached an all-time low of 15.9 trillion rubles ($152.15 billion) so far this year due to high interest rates, the country’s second-largest bank VTB said Wednesday. “According to our estimates, the share of cash rubles in savings and investments, excluding pension and insurance products, is currently about 15%, or about 15.9 trillion rubles,” VTB’s deputy chairman of the board Georgy Gorshkov said at the lender’s investment forum. “This is a historical minimum over the last six years, and it may decrease by a couple more percentage points by the end of the year,” he added.", "language": "English", "datePublished": "2024-12-04T16:27:00+03:00", "dateModified": "2024-12-08T20:14:21+03:00", "content": "Dear readers, We are facing unprecedented challenges. Russia's Prosecutor General's Office has designated The Moscow Times as an \"undesirable\" organization, criminalizing our work and putting our staff at risk of prosecution. This follows our earlier unjust labeling as a \"foreign agent.\" These actions are direct attempts to silence independent journalism in Russia. The authorities claim our work \"discredits the decisions of the Russian leadership.\" We see things differently: we strive to provide accurate, unbiased reporting on Russia. We, the journalists of The Moscow Times, refuse to be silenced. But to continue our work,  .  It's quick to set up, and every contribution makes a significant impact. By supporting The Moscow Times, you're defending open, independent journalism in the face of repression. Thank you for standing with us.", "publisher": {"name": "The Moscow Times", "logo": "https://static.themoscowtimes.com/img/logo.png"}, "author": "The Moscow Times", "images": ["https://static.themoscowtimes.com/image/og/fc/87227__fc1606e6b533606d6099a0cd4617b01a.jpg"], "keywords": ["VTB,Economy,Banks"]},
{"url": "https://www.themoscowtimes.com/2024/12/04/russian-fm-lavrov-to-visit-malta-in-first-eu-trip-since-2021-a87231", "crawled_from": "The Moscow Times", "title": "Russian FM Lavrov to Visit Malta in First EU Trip Since 2021", "description": "Russian Foreign Minister Sergei Lavrov will travel to Malta on Thursday for an Organisation for Security and Cooperation in Europe (OSCE) summit, Moscow confirmed, his first visit to an EU member since Russia launched its full-scale invasion of Ukraine.", "language": "English", "datePublished": "2024-12-04T19:03:23+03:00", "dateModified": "2024-12-08T20:14:21+03:00", "content": "Dear readers, We are facing unprecedented challenges. Russia's Prosecutor General's Office has designated The Moscow Times as an \"undesirable\" organization, criminalizing our work and putting our staff at risk of prosecution. This follows our earlier unjust labeling as a \"foreign agent.\" These actions are direct attempts to silence independent journalism in Russia. The authorities claim our work \"discredits the decisions of the Russian leadership.\" We see things differently: we strive to provide accurate, unbiased reporting on Russia. We, the journalists of The Moscow Times, refuse to be silenced. But to continue our work,  .  It's quick to set up, and every contribution makes a significant impact. By supporting The Moscow Times, you're defending open, independent journalism in the face of repression. Thank you for standing with us.", "publisher": {"name": "The Moscow Times", "logo": "https://static.themoscowtimes.com/img/logo.png"}, "author": "AFP", "images": ["https://static.themoscowtimes.com/image/og/01/87231__01d805981dea6c8ad6838905a456c374.jpg"], "keywords": ["Lavrov,OSCE,European Union"]},
{"url": "https://www.themoscowtimes.com/2024/12/04/ukraine-says-mayor-jailed-by-russia-died-by-torture-a87226", "crawled_from": "The Moscow Times", "title": "Ukraine Says Mayor Jailed by Russia Died by Torture\n", "description": "Ukraine said Wednesday that the body of a mayor captured by Russian forces in the Zaporizhzhia region at the start of the full-scale invasion in 2022, who allegedly died in their captivity, had been returned by Moscow.", "language": "English", "datePublished": "2024-12-04T14:37:00+03:00", "dateModified": "2024-12-08T20:14:21+03:00", "content": "Dear readers, We are facing unprecedented challenges. Russia's Prosecutor General's Office has designated The Moscow Times as an \"undesirable\" organization, criminalizing our work and putting our staff at risk of prosecution. This follows our earlier unjust labeling as a \"foreign agent.\" These actions are direct attempts to silence independent journalism in Russia. The authorities claim our work \"discredits the decisions of the Russian leadership.\" We see things differently: we strive to provide accurate, unbiased reporting on Russia. We, the journalists of The Moscow Times, refuse to be silenced. But to continue our work,  .  It's quick to set up, and every contribution makes a significant impact. By supporting The Moscow Times, you're defending open, independent journalism in the face of repression. Thank you for standing with us.", "publisher": {"name": "The Moscow Times", "logo": "https://static.themoscowtimes.com/img/logo.png"}, "author": "AFP", "images": ["https://static.themoscowtimes.com/image/og/09/87226__09586f3a443fd7ab6d9655064a0e5e37.jpg"], "keywords": ["Zaporizhzhia,Ukraine war,prisoners of war"]},
{"url": "https://www.themoscowtimes.com/2024/12/05/russia-north-korea-defense-pact-enters-force-a87233", "crawled_from": "The Moscow Times", "title": "Russia-North Korea Defense Pact Enters Into Force", "description": "A mutual defense pact between North Korea and Russia entered into force Wednesday after the two sides exchanged ratification documents.", "language": "English", "datePublished": "2024-12-05T13:55:00+03:00", "dateModified": "2024-12-08T20:12:36+03:00", "content": "Dear readers, We are facing unprecedented challenges. Russia's Prosecutor General's Office has designated The Moscow Times as an \"undesirable\" organization, criminalizing our work and putting our staff at risk of prosecution. This follows our earlier unjust labeling as a \"foreign agent.\" These actions are direct attempts to silence independent journalism in Russia. The authorities claim our work \"discredits the decisions of the Russian leadership.\" We see things differently: we strive to provide accurate, unbiased reporting on Russia. We, the journalists of The Moscow Times, refuse to be silenced. But to continue our work,  .  It's quick to set up, and every contribution makes a significant impact. By supporting The Moscow Times, you're defending open, independent journalism in the face of repression. Thank you for standing with us.", "publisher": {"name": "The Moscow Times", "logo": "https://static.themoscowtimes.com/img/logo.png"}, "author": "The Moscow Times", "images": ["https://static.themoscowtimes.com/image/og/5c/87233__5c6c2cbf8d4c88c585d9b4b399804bbb.jpg"], "keywords": ["North Korea,Putin,Defense"]},
{"url": "https://www.themoscowtimes.com/2024/12/05/chechnyas-kadyrov-slams-russian-police-chief-top-investigator-a87232", "crawled_from": "The Moscow Times", "title": "Chechnya’s Kadyrov Slams Russian Police Chief, Top Investigator ", "description": "Chechen leader Ramzan Kadyrov criticized Russia’s top investigator and police chief for fueling anti-immigrant sentiment and tensions with neighboring countries during his annual call-in show Wednesday.", "language": "English", "datePublished": "2024-12-05T13:23:00+03:00", "dateModified": "2024-12-08T20:14:21+03:00", "content": "Dear readers, We are facing unprecedented challenges. Russia's Prosecutor General's Office has designated The Moscow Times as an \"undesirable\" organization, criminalizing our work and putting our staff at risk of prosecution. This follows our earlier unjust labeling as a \"foreign agent.\" These actions are direct attempts to silence independent journalism in Russia. The authorities claim our work \"discredits the decisions of the Russian leadership.\" We see things differently: we strive to provide accurate, unbiased reporting on Russia. We, the journalists of The Moscow Times, refuse to be silenced. But to continue our work,  .  It's quick to set up, and every contribution makes a significant impact. By supporting The Moscow Times, you're defending open, independent journalism in the face of repression. Thank you for standing with us.", "publisher": {"name": "The Moscow Times", "logo": "https://static.themoscowtimes.com/img/logo.png"}, "author": "The Moscow Times", "images": ["https://static.themoscowtimes.com/image/og/18/87232__189de8003690be9942ece47da3264b82.jpg"], "keywords": ["Chechnya,Bastrykin,Kadyrov"]},
{"url": "https://www.themoscowtimes.com/2024/12/05/russian-ships-crew-fired-signal-flares-toward-german-helicopter-2-a87237", "crawled_from": "The Moscow Times", "title": "Russian Ship's Crew Fired Signal Flares Toward German Helicopter", "description": "Germany's defense minister voiced concern Thursday about a Russian cargo ship firing a signal flare toward a German military helicopter in the Baltic Sea.", "language": "English", "datePublished": "2024-12-05T15:35:00+03:00", "dateModified": "2024-12-08T20:08:43+03:00", "content": "Germany's defense minister voiced concern Thursday about a Russian cargo ship firing a signal flare toward a German military helicopter in the Baltic Sea. The incident, which comes as the Ukraine war has sharply heightened regional tensions, evokes the “classic provocative behavior that we know from the time of the Cold War,” said Defense Minister Boris Pistorius. AFP understands the incident, which occurred last week, involved the crew of a Russian cargo ship firing red signal flares at a German helicopter without hitting it. Pistorius did not go into detail about the incident but said “In this case no one was hurt and no one was in danger.” “We have repeatedly had incidents in the Baltic where it turned out that Russian ships were firing warning shots into the air or into the water,” Pistorius told public broadcaster Deutschlandfunk. While Germany “can never exclude” the possibility that such incidents would lead to direct escalation, Pistorius said that German vessels “and those of our allies are behaving prudently and with foresight.” “They report these incidents, they respond with de-escalatory measures and don’t let themselves get taken in” by such behavior, he said. Worries about sabotage in the Baltic Sea were recently heightened after undersea data cables were cut, with suspicion falling on a Chinese vessel. Foreign Minister Annalena Baerbock also hinted at the most recent incident in comments on Wednesday in which she referred to \"helicopters from Germany suddenly being fired upon by tankers.” Germany is Ukraine’s second-biggest supplier of military aid and German officials have repeatedly raised the alarm in recent months about Russian “hybrid warfare,” including acts of sabotage. Russian Foreign Minister Sergei Lavrov on Thursday blamed the West for triggering a new Cold War, and warned it risked turning into an East-West conflict, the state-run RIA Novosti news agency reported. In remarks to an OSCE summit in Malta, RIA Novosti quoted Lavrov as saying that the West was behind a “reincarnation of the Cold War, only now with a much greater risk of a transition to a hot one.” Dear readers, We are facing unprecedented challenges. Russia's Prosecutor General's Office has designated The Moscow Times as an \"undesirable\" organization, criminalizing our work and putting our staff at risk of prosecution. This follows our earlier unjust labeling as a \"foreign agent.\" These actions are direct attempts to silence independent journalism in Russia. The authorities claim our work \"discredits the decisions of the Russian leadership.\" We see things differently: we strive to provide accurate, unbiased reporting on Russia. We, the journalists of The Moscow Times, refuse to be silenced. But to continue our work,  .  It's quick to set up, and every contribution makes a significant impact. By supporting The Moscow Times, you're defending open, independent journalism in the face of repression. Thank you for standing with us.", "publisher": {"name": "The Moscow Times", "logo": "https://static.themoscowtimes.com/img/logo.png"}, "author": "AFP", "images": ["https://static.themoscowtimes.com/image/og/8d/87237__8dda682abdd70658d8b6d61cc0343a40.jpg"], "keywords": ["Germany,military,International Relations"]},
{"url": "https://www.themoscowtimes.com/2024/12/05/georgian-pm-vows-to-eradicate-opposition-amid-pro-eu-protests-a87236", "crawled_from": "The Moscow Times", "title": "Georgian PM Vows to ‘Eradicate’ Opposition Amid Pro-EU Protests", "description": "Georgia's prime minister vowed Thursday to “eradicate” the country's “liberal-fascist” opposition, escalating the government's bitter campaign against its rivals as mass pro-EU protests enter their second week.", "language": "English", "datePublished": "2024-12-05T16:25:07+03:00", "dateModified": "2024-12-08T20:13:11+03:00", "content": "Dear readers, We are facing unprecedented challenges. Russia's Prosecutor General's Office has designated The Moscow Times as an \"undesirable\" organization, criminalizing our work and putting our staff at risk of prosecution. This follows our earlier unjust labeling as a \"foreign agent.\" These actions are direct attempts to silence independent journalism in Russia. The authorities claim our work \"discredits the decisions of the Russian leadership.\" We see things differently: we strive to provide accurate, unbiased reporting on Russia. We, the journalists of The Moscow Times, refuse to be silenced. But to continue our work,  .  It's quick to set up, and every contribution makes a significant impact. By supporting The Moscow Times, you're defending open, independent journalism in the face of repression. Thank you for standing with us.", "publisher": {"name": "The Moscow Times", "logo": "https://static.themoscowtimes.com/img/logo.png"}, "author": "The Moscow Times", "images": ["https://static.themoscowtimes.com/image/og/51/87236__515443b3907f382178e695c476fa091d.jpg"], "keywords": ["Georgia,Repression"]},
{"url": "https://www.themoscowtimes.com/2024/12/05/russia-is-touting-itself-as-a-haven-for-conservative-westerners-will-they-make-the-move-a87178", "crawled_from": "The Moscow Times", "title": "Russia Is Touting Itself as a Haven for 'Conservative' Westerners. Will They Make the Move?", "description": "Maria Butina was once imprisoned in the United States for acting as an unregistered foreign agent by infiltrating conservative circles during the 2016 U.S. presidential election.", "language": "English", "datePublished": "2024-12-05T14:51:00+03:00", "dateModified": "2024-12-08T20:14:22+03:00", "content": "Dear readers, We are facing unprecedented challenges. Russia's Prosecutor General's Office has designated The Moscow Times as an \"undesirable\" organization, criminalizing our work and putting our staff at risk of prosecution. This follows our earlier unjust labeling as a \"foreign agent.\" These actions are direct attempts to silence independent journalism in Russia. The authorities claim our work \"discredits the decisions of the Russian leadership.\" We see things differently: we strive to provide accurate, unbiased reporting on Russia. We, the journalists of The Moscow Times, refuse to be silenced. But to continue our work,  .  It's quick to set up, and every contribution makes a significant impact. By supporting The Moscow Times, you're defending open, independent journalism in the face of repression. Thank you for standing with us.", "publisher": {"name": "The Moscow Times", "logo": "https://static.themoscowtimes.com/img/logo.png"}, "author": "James Beardsworth", "images": ["https://static.themoscowtimes.com/image/og/fe/87178__fe162d10f4c9287841a5ddb4078e2a1b.jpg"], "keywords": [""]},
{"url": "https://www.themoscowtimes.com/2024/12/05/russia-closes-polish-consulate-in-st-petersburg-a87240", "crawled_from": "The Moscow Times", "title": "Russia Closes Polish Consulate in St. Petersburg", "description": "Russia has ordered the Polish consulate in St.", "language": "English", "datePublished": "2024-12-05T18:25:11+03:00", "dateModified": "2024-12-08T20:07:04+03:00", "content": "Dear readers, We are facing unprecedented challenges. Russia's Prosecutor General's Office has designated The Moscow Times as an \"undesirable\" organization, criminalizing our work and putting our staff at risk of prosecution. This follows our earlier unjust labeling as a \"foreign agent.\" These actions are direct attempts to silence independent journalism in Russia. The authorities claim our work \"discredits the decisions of the Russian leadership.\" We see things differently: we strive to provide accurate, unbiased reporting on Russia. We, the journalists of The Moscow Times, refuse to be silenced. But to continue our work,  .  It's quick to set up, and every contribution makes a significant impact. By supporting The Moscow Times, you're defending open, independent journalism in the face of repression. Thank you for standing with us.", "publisher": {"name": "The Moscow Times", "logo": "https://static.themoscowtimes.com/img/logo.png"}, "author": "The Moscow Times", "images": ["https://static.themoscowtimes.com/image/og/98/87240__9895f3bc1f1865907dbe86c588f79d8a.jpg"], "keywords": ["Poland,Diplomacy,St. Petersburg"]},
{"url": "https://www.themoscowtimes.com/2024/12/05/police-search-russian-home-of-exiled-media-editors-parents-a87235", "crawled_from": "The Moscow Times", "title": "Russian Police Search Home of Exiled Media Editor’s Parents", "description": "Police in Russia carried out a search and seizure warrant at the home of the parents of an exiled investigative news outlet’s editor-in-chief.", "language": "English", "datePublished": "2024-12-05T15:31:17+03:00", "dateModified": "2024-12-08T20:14:22+03:00", "content": "Dear readers, We are facing unprecedented challenges. Russia's Prosecutor General's Office has designated The Moscow Times as an \"undesirable\" organization, criminalizing our work and putting our staff at risk of prosecution. This follows our earlier unjust labeling as a \"foreign agent.\" These actions are direct attempts to silence independent journalism in Russia. The authorities claim our work \"discredits the decisions of the Russian leadership.\" We see things differently: we strive to provide accurate, unbiased reporting on Russia. We, the journalists of The Moscow Times, refuse to be silenced. But to continue our work,  .  It's quick to set up, and every contribution makes a significant impact. By supporting The Moscow Times, you're defending open, independent journalism in the face of repression. Thank you for standing with us.", "publisher": {"name": "The Moscow Times", "logo": "https://static.themoscowtimes.com/img/logo.png"}, "author": "The Moscow Times", "images": ["https://static.themoscowtimes.com/image/og/69/87235__694306fdfe0ace5a3e1d2efa27ead123.jpg"], "keywords": ["Repression,Far East"]},
{"url": "https://www.themoscowtimes.com/2024/12/05/putin-orders-signing-of-russia-belarus-security-deal-a87241", "crawled_from": "The Moscow Times", "title": "Putin Orders Signing of Russia-Belarus Security Deal", "description": "President Vladimir Putin has ordered the signing of a pact offering closely guarded security guarantees between Russia and Belarus at an upcoming summit on Friday. “The treaty is considered appropriate to sign at the highest level,” Putin’s decree states.", "language": "English", "datePublished": "2024-12-05T19:04:16+03:00", "dateModified": "2024-12-08T20:14:10+03:00", "content": "Dear readers, We are facing unprecedented challenges. Russia's Prosecutor General's Office has designated The Moscow Times as an \"undesirable\" organization, criminalizing our work and putting our staff at risk of prosecution. This follows our earlier unjust labeling as a \"foreign agent.\" These actions are direct attempts to silence independent journalism in Russia. The authorities claim our work \"discredits the decisions of the Russian leadership.\" We see things differently: we strive to provide accurate, unbiased reporting on Russia. We, the journalists of The Moscow Times, refuse to be silenced. But to continue our work,  .  It's quick to set up, and every contribution makes a significant impact. By supporting The Moscow Times, you're defending open, independent journalism in the face of repression. Thank you for standing with us.", "publisher": {"name": "The Moscow Times", "logo": "https://static.themoscowtimes.com/img/logo.png"}, "author": "The Moscow Times", "images": ["https://static.themoscowtimes.com/image/og/3b/87241__3b4475024b8de0b65ee3a0b1c69caa53.jpg"], "keywords": ["Belarus,Union State,Security"]},
{"url": "https://www.themoscowtimes.com/2024/12/05/chechen-leader-says-drone-attack-on-grozny-wounded-civilians-a87234", "crawled_from": "The Moscow Times", "title": "Chechen Leader Says Drone Attack on Grozny Wounded Civilians", "description": "Chechen leader Ramzan Kadyrov said Wednesday that a Ukrainian drone attack on Grozny damaged the premises of a special police unit fighting in Ukraine and also injured civilians, the second such attack on the North Caucasus region. “Today in the center of the city they struck with a drone.", "language": "English", "datePublished": "2024-12-05T14:02:52+03:00", "dateModified": "2024-12-08T20:14:22+03:00", "content": "Chechen leader Ramzan Kadyrov said Wednesday that a Ukrainian drone attack on Grozny damaged the premises of a special police unit fighting in Ukraine and also injured civilians, the second such attack on the North Caucasus region. “Today in the center of the city they struck with a drone. They destroyed the regiment’s roof. Civilians were injured,” Kadyrov said during a televised question-and-answer session, RIA Novosti reported. The regiment is a police special forces unit named after Akhmat Kadyrov, the current leader's late father and predecessor, the state news agency wrote. Earlier, Russian military bloggers published footage of a night-time explosion and images of a destroyed roof inside the regiment's walled complex, attributing the attack to Ukraine. In October, Kadyrov said a drone had   a building of the Russian Special Forces University in Gudermes, used to train volunteers to fight in Ukraine. Kadyrov brought a group of 12 prisoners of war captured in Ukraine to his annual call-in session and interrogated them on air, RIA Novosti reported. Dear readers, We are facing unprecedented challenges. Russia's Prosecutor General's Office has designated The Moscow Times as an \"undesirable\" organization, criminalizing our work and putting our staff at risk of prosecution. This follows our earlier unjust labeling as a \"foreign agent.\" These actions are direct attempts to silence independent journalism in Russia. The authorities claim our work \"discredits the decisions of the Russian leadership.\" We see things differently: we strive to provide accurate, unbiased reporting on Russia. We, the journalists of The Moscow Times, refuse to be silenced. But to continue our work,  .  It's quick to set up, and every contribution makes a significant impact. By supporting The Moscow Times, you're defending open, independent journalism in the face of repression. Thank you for standing with us.", "publisher": {"name": "The Moscow Times", "logo": "https://static.themoscowtimes.com/img/logo.png"}, "author": "AFP", "images": ["https://static.themoscowtimes.com/image/og/52/87234__52b5d18ab124867653a73023d68c5e68.jpg"], "keywords": ["Chechnya,drones,Ukraine war"]},
{"url": "https://www.themoscowtimes.com/2024/12/05/russian-fm-lavrov-warns-of-new-cold-war-turning-hot-a87239", "crawled_from": "The Moscow Times", "title": "Russian FM Lavrov Warns of New Cold War Turning ‘Hot’", "description": "Russian Foreign Minister Sergei Lavrov on Thursday warned that the new Cold War Moscow blames on the West risks turning into a “hot” East-West conflict., the state-run RIA Novosti news agency reported.", "language": "English", "datePublished": "2024-12-05T16:52:00+03:00", "dateModified": "2024-12-08T20:14:22+03:00", "content": "Dear readers, We are facing unprecedented challenges. Russia's Prosecutor General's Office has designated The Moscow Times as an \"undesirable\" organization, criminalizing our work and putting our staff at risk of prosecution. This follows our earlier unjust labeling as a \"foreign agent.\" These actions are direct attempts to silence independent journalism in Russia. The authorities claim our work \"discredits the decisions of the Russian leadership.\" We see things differently: we strive to provide accurate, unbiased reporting on Russia. We, the journalists of The Moscow Times, refuse to be silenced. But to continue our work,  .  It's quick to set up, and every contribution makes a significant impact. By supporting The Moscow Times, you're defending open, independent journalism in the face of repression. Thank you for standing with us.", "publisher": {"name": "The Moscow Times", "logo": "https://static.themoscowtimes.com/img/logo.png"}, "author": "The Moscow Times", "images": ["https://static.themoscowtimes.com/image/og/77/87239__7726bb6f366b520115c6619e18c13d72.jpg"], "keywords": ["Lavrov,OSCE,European Union"]},
{"url": "https://www.themoscowtimes.com/2024/12/05/russia-us-army-chiefs-hold-rare-call-amid-ukraine-escalation-a87242", "crawled_from": "The Moscow Times", "title": "Russia, U.S. Army Chiefs Hold Rare Call Amid Ukraine Escalation", "description": "The Russian and U.S. army chiefs held a rare phone call last week amid escalation in Ukraine, officials from both sides have said.", "language": "English", "datePublished": "2024-12-05T19:31:54+03:00", "dateModified": "2024-12-08T20:07:40+03:00", "content": "The Russian and U.S. army chiefs held a rare phone call last week amid escalation in Ukraine, officials from both sides have said. Direct contact between Moscow and Washington has almost ceased to exist amid Russia’s full-scale invasion of Ukraine, and the Kremlin has said it considers the United States a direct participant in the conflict. The call, between Russia's Chief of the General Staff Valery Gerasimov and the U.S. Chairman of the Joint Chiefs of Staff General Charles Brown, occurred on Nov. 27 and was held at the request of the Russian side, both Moscow and Washington said. “The leaders discussed a number of global and regional security issues to include the ongoing conflict in Ukraine,” Brown’s spokesman told AFP. It was the first call between the pair since Brown took over the role in October 2023. The Russian defense ministry   Gerasimov had informed Brown about Russian military drills in the eastern Mediterranean, announced as Moscow conducts air strikes to support its ally, Syrian President Bashar al-Assad, in quashing an Islamist-led rebellion. “This information was given with the goal of preventing possible incidents in connection with the presence of U.S. and NATO ships near the area of Russian drills,” it said in a statement on Telegram. It did not mention Ukraine or any other topic. Citing a U.S. military spokesperson, the New York Times reported that the pair discussed Russia's new Oreshnik hypersonic ballistic missile. Brown also expressed U.S. concern over the deployment of North Korean troops to support Russia's army on the battlefield, CNN reported. Tensions between Russia and the United States have escalated since Donald Trump won the presidential election in November. The outgoing Biden administration has given Kyiv the green light to fire U.S.-supplied ATACMS missiles on Russian territory, while Russia lowered its threshold for the use of nuclear weapons. In response to Kyiv striking Russian border regions with Western weapons, Russia said it “test fired” a never-before-seen nuclear-capable missile in a strike on the Ukrainian city of Dnipro. Dear readers, We are facing unprecedented challenges. Russia's Prosecutor General's Office has designated The Moscow Times as an \"undesirable\" organization, criminalizing our work and putting our staff at risk of prosecution. This follows our earlier unjust labeling as a \"foreign agent.\" These actions are direct attempts to silence independent journalism in Russia. The authorities claim our work \"discredits the decisions of the Russian leadership.\" We see things differently: we strive to provide accurate, unbiased reporting on Russia. We, the journalists of The Moscow Times, refuse to be silenced. But to continue our work,  .  It's quick to set up, and every contribution makes a significant impact. By supporting The Moscow Times, you're defending open, independent journalism in the face of repression. Thank you for standing with us.", "publisher": {"name": "The Moscow Times", "logo": "https://static.themoscowtimes.com/img/logo.png"}, "author": "AFP", "images": ["https://static.themoscowtimes.com/image/og/76/87242__76292630709c5f9429e29d1be817bd5b.jpg"], "keywords": ["US-Russia,Ukraine war,Syria"]},
{"url": "https://www.themoscowtimes.com/2024/12/06/ukraine-launches-air-sea-drones-near-crimea-bridge-reports-a87246", "crawled_from": "The Moscow Times", "title": "Ukraine Launches Air, Sea Drones Near Crimea Bridge – Reports", "description": "Ukraine launched aerial and seaborne drones on the Russian-controlled Crimean port city of Kerch, media reported and the Russian military confirmed early Friday.", "language": "English", "datePublished": "2024-12-06T13:43:00+03:00", "dateModified": "2024-12-08T20:04:30+03:00", "content": "Dear readers, We are facing unprecedented challenges. Russia's Prosecutor General's Office has designated The Moscow Times as an \"undesirable\" organization, criminalizing our work and putting our staff at risk of prosecution. This follows our earlier unjust labeling as a \"foreign agent.\" These actions are direct attempts to silence independent journalism in Russia. The authorities claim our work \"discredits the decisions of the Russian leadership.\" We see things differently: we strive to provide accurate, unbiased reporting on Russia. We, the journalists of The Moscow Times, refuse to be silenced. But to continue our work,  .  It's quick to set up, and every contribution makes a significant impact. By supporting The Moscow Times, you're defending open, independent journalism in the face of repression. Thank you for standing with us.", "publisher": {"name": "The Moscow Times", "logo": "https://static.themoscowtimes.com/img/logo.png"}, "author": "The Moscow Times", "images": ["https://static.themoscowtimes.com/image/og/4c/87246__4c8a4a6b216dea7b6edd9555b99254a5.jpg"], "keywords": ["Ukraine war,Crimea,drones"]},
{"url": "https://www.themoscowtimes.com/2024/12/06/putin-replaces-head-of-partly-occupied-kursk-region-a87244", "crawled_from": "The Moscow Times", "title": "Putin Replaces Head of Partly Occupied Kursk Region", "description": "President Vladimir Putin on Thursday appointed federal lawmaker Alexander Khinshtein as the acting governor of southwestern Russia’s Kursk region, which has faced protests since being partly occupied by Ukrainian forces four months ago. “Crisis management is in demand there now,” Putin told Khinshtein in their Kremlin meeting, highlighting the veteran State Duma member’s two-year stint as an advisor to Russia’s National Guard director. “As the territory is liberated from the enemy, of course, much will have to be done there to restore the housing and utilities sector and the economy,” Putin said.", "language": "English", "datePublished": "2024-12-06T13:12:01+03:00", "dateModified": "2024-12-08T20:10:44+03:00", "content": "Dear readers, We are facing unprecedented challenges. Russia's Prosecutor General's Office has designated The Moscow Times as an \"undesirable\" organization, criminalizing our work and putting our staff at risk of prosecution. This follows our earlier unjust labeling as a \"foreign agent.\" These actions are direct attempts to silence independent journalism in Russia. The authorities claim our work \"discredits the decisions of the Russian leadership.\" We see things differently: we strive to provide accurate, unbiased reporting on Russia. We, the journalists of The Moscow Times, refuse to be silenced. But to continue our work,  .  It's quick to set up, and every contribution makes a significant impact. By supporting The Moscow Times, you're defending open, independent journalism in the face of repression. Thank you for standing with us.", "publisher": {"name": "The Moscow Times", "logo": "https://static.themoscowtimes.com/img/logo.png"}, "author": "The Moscow Times", "images": ["https://static.themoscowtimes.com/image/og/4d/87244__4d85c4fbd9735e5835715f890beccd20.jpg"], "keywords": ["Kursk,government,Putin"]},
{"url": "https://www.themoscowtimes.com/2024/12/06/crimean-court-jails-2-for-passing-russian-military-data-to-ukraine-a87247", "crawled_from": "The Moscow Times", "title": "Crimean Court Jails 2 for Passing Russian Military Data to Ukraine", "description": "A court in Moscow-annexed Crimea on Friday convicted two men of treason for giving Ukraine information on movements of Russian military equipment and ships, handing them lengthy prison sentences.", "language": "English", "datePublished": "2024-12-06T13:48:00+03:00", "dateModified": "2024-12-08T20:08:28+03:00", "content": "A court in Moscow-annexed Crimea on Friday convicted two men of treason for giving Ukraine information on movements of Russian military equipment and ships, handing them lengthy prison sentences. Russia has issued large numbers of exceptionally harsh judgments against its citizens convicted of aiding Ukraine since Moscow launched its offensive in February 2022. One of the men, Dmitry Pospelov, had allegedly been cooperating with Ukraine's SBU security service since 2017, prosecutors said. He moved to Crimea, where he worked installing and servicing security cameras in hotels. He gave the SBU access to the footage, allowing them to monitor roads used to move Russian military equipment, and provided data on users of an Internet provider. Crimea's Supreme Court sentenced him to 13 years in a maximum-security penal colony. The other man, Vladislav Afanasyev, was found guilty of giving money to support Ukraine's army and passing \"photos and geographical coordinates of locations\" of naval ships. \"This data was reliable\" and could have been used to carry out attacks, prosecutors said. The court sentenced Afanasyev to 15 years in a maximum-security prison colony. Dear readers, We are facing unprecedented challenges. Russia's Prosecutor General's Office has designated The Moscow Times as an \"undesirable\" organization, criminalizing our work and putting our staff at risk of prosecution. This follows our earlier unjust labeling as a \"foreign agent.\" These actions are direct attempts to silence independent journalism in Russia. The authorities claim our work \"discredits the decisions of the Russian leadership.\" We see things differently: we strive to provide accurate, unbiased reporting on Russia. We, the journalists of The Moscow Times, refuse to be silenced. But to continue our work,  .  It's quick to set up, and every contribution makes a significant impact. By supporting The Moscow Times, you're defending open, independent journalism in the face of repression. Thank you for standing with us.", "publisher": {"name": "The Moscow Times", "logo": "https://static.themoscowtimes.com/img/logo.png"}, "author": "AFP", "images": ["https://static.themoscowtimes.com/image/og/45/87247__450ee57dbd958527bd498ca6e3596891.jpg"], "keywords": ["Ukraine war,Crimea,Russian military,treason,criminal case"]},
{"url": "https://www.themoscowtimes.com/2024/12/06/russia-takes-villages-in-key-areas-of-east-ukraine-front-a87248", "crawled_from": "The Moscow Times", "title": "Russia Takes Villages in Key Areas of East Ukraine Front", "description": "Russia said Friday its forces had captured a village near the embattled supply hub of Pokrovsk and another near the industrial town of Kurakhove, gaining ground in two key areas of the east Ukraine front line.", "language": "English", "datePublished": "2024-12-06T13:59:30+03:00", "dateModified": "2024-12-08T20:05:26+03:00", "content": "Russia said Friday its forces had captured a village near the embattled supply hub of Pokrovsk and another near the industrial town of Kurakhove, gaining ground in two key areas of the east Ukraine front line. Moscow has been advancing in east Ukraine for months, pressing its advantage against overstretched and outgunned Ukrainian soldiers. Russian army units \"liberated the settlements\" of Sukhi Yaly and Pustynka in the eastern Donetsk region, Moscow's Defense Ministry said in a daily briefing. Sukhi Yaly is about 13 kilometers southwest of Kurakhove, a strategic industrial town on the banks of a reservoir that Moscow is trying to encircle. Pustynka lies just south of Pokrovsk, an embattled logistics hub at the intersection of rail and road routes supplying Ukrainian troops across the front line. The nearly three-year conflict has escalated sharply in recent months, with Kyiv deploying U.S. and British-supplied long-range missiles in attacks on Russian soil and Moscow firing an experimental hypersonic weapon at Ukraine in response. Ukraine has been trying to put itself in as secure a position as possible ahead of U.S. President-elect Donald Trump's return to the White House in January. The Republican has promised to swiftly end the conflict once in power, raising concerns in Kyiv that Ukraine will be forced to make massive territorial concessions to Moscow. Dear readers, We are facing unprecedented challenges. Russia's Prosecutor General's Office has designated The Moscow Times as an \"undesirable\" organization, criminalizing our work and putting our staff at risk of prosecution. This follows our earlier unjust labeling as a \"foreign agent.\" These actions are direct attempts to silence independent journalism in Russia. The authorities claim our work \"discredits the decisions of the Russian leadership.\" We see things differently: we strive to provide accurate, unbiased reporting on Russia. We, the journalists of The Moscow Times, refuse to be silenced. But to continue our work,  .  It's quick to set up, and every contribution makes a significant impact. By supporting The Moscow Times, you're defending open, independent journalism in the face of repression. Thank you for standing with us.", "publisher": {"name": "The Moscow Times", "logo": "https://static.themoscowtimes.com/img/logo.png"}, "author": "AFP", "images": ["https://static.themoscowtimes.com/image/og/70/87248__70eaf97f0be86e136fd983eb245c488f.jpg"], "keywords": ["Ukraine war"]},
{"url": "https://www.themoscowtimes.com/2024/12/06/russia-denies-interfering-in-romanian-elections-a87245", "crawled_from": "The Moscow Times", "title": "Russia Denies Interfering in Romanian Elections", "description": "Russia denied on Thursday it was interfering in Romania's elections, as the EU member geared up for the second round of its presidential vote that could see a pro-Russian candidate win.", "language": "English", "datePublished": "2024-12-06T14:28:00+03:00", "dateModified": "2024-12-08T20:05:17+03:00", "content": "However, Romania’s constitutional court announced on Friday that it was canceling the presidential election. The court has decided “to annul the entire electoral process for the election of the President of Romania… to ensure the correctness and legality of the electoral process,” it said. Dear readers, We are facing unprecedented challenges. Russia's Prosecutor General's Office has designated The Moscow Times as an \"undesirable\" organization, criminalizing our work and putting our staff at risk of prosecution. This follows our earlier unjust labeling as a \"foreign agent.\" These actions are direct attempts to silence independent journalism in Russia. The authorities claim our work \"discredits the decisions of the Russian leadership.\" We see things differently: we strive to provide accurate, unbiased reporting on Russia. We, the journalists of The Moscow Times, refuse to be silenced. But to continue our work,  .  It's quick to set up, and every contribution makes a significant impact. By supporting The Moscow Times, you're defending open, independent journalism in the face of repression. Thank you for standing with us.", "publisher": {"name": "The Moscow Times", "logo": "https://static.themoscowtimes.com/img/logo.png"}, "author": "AFP", "images": ["https://static.themoscowtimes.com/image/og/e0/87245__e00c31b341838e3d7ca1ec111a2025ee.jpg"], "keywords": ["Romania,Elections,European Union"]},
{"url": "https://www.themoscowtimes.com/2024/12/06/russia-says-seized-eu-bound-cocaine-haul-worth-millions-a87249", "crawled_from": "The Moscow Times", "title": "Russia Says Seized EU-Bound Cocaine Haul Worth Millions", "description": "Russia said Friday it had arrested suspected members of a Colombian cartel trying to smuggle tens of millions of dollars worth of cocaine into Europe.", "language": "English", "datePublished": "2024-12-06T14:28:04+03:00", "dateModified": "2024-12-08T20:05:17+03:00", "content": "Russia said Friday it had arrested suspected members of a Colombian cartel trying to smuggle tens of millions of dollars worth of cocaine into Europe. The suspects were caught loading 570 kilograms (1,250 pounds) of the illegal substance into a container intended for shipment to the European Union, according to Russia's FSB security service. The FSB suggested the smugglers brought the drugs into Russia from Peru hidden in a vehicle, and that they were members of Colombia's infamous Cali cartel. \"Five hundred and seventy kilograms of cocaine were seized, the wholesale value of which on the Russian black market is 1.5 billion rubles, the retail value exceeding 5.5 billion rubles [$55 million],\" the FSB said in a statement on its website. Colombia is the world's biggest cocaine producer and exporter, mainly to the United States and Europe. Last year, the South American country set a new record for cocaine production and cultivation of the coca leaf the drug is made from. Russia has a zero-tolerance policy towards drug use and smuggling, handing heavy sentences to those convicted of trafficking small amounts of narcotics. Russian customs seized almost three tons of cocaine in the first nine months of the year, according to authorities. The Cali cartel controlled up to 80% of the cocaine trade to the United States at its peak in the mid-1990s, according to US authorities. Dear readers, We are facing unprecedented challenges. Russia's Prosecutor General's Office has designated The Moscow Times as an \"undesirable\" organization, criminalizing our work and putting our staff at risk of prosecution. This follows our earlier unjust labeling as a \"foreign agent.\" These actions are direct attempts to silence independent journalism in Russia. The authorities claim our work \"discredits the decisions of the Russian leadership.\" We see things differently: we strive to provide accurate, unbiased reporting on Russia. We, the journalists of The Moscow Times, refuse to be silenced. But to continue our work,  .  It's quick to set up, and every contribution makes a significant impact. By supporting The Moscow Times, you're defending open, independent journalism in the face of repression. Thank you for standing with us.", "publisher": {"name": "The Moscow Times", "logo": "https://static.themoscowtimes.com/img/logo.png"}, "author": "AFP", "images": ["https://static.themoscowtimes.com/image/og/6f/87249__6fd36537554358b3b847fd1619393d16.jpg"], "keywords": ["Drugs,FSB"]},
{"url": "https://www.themoscowtimes.com/2024/12/06/hospitalized-russian-soldiers-protest-forced-return-to-front-reports-a87252", "crawled_from": "The Moscow Times", "title": "Hospitalized Russian Soldiers Protest Forced Return to Front – Reports", "description": "The Russian military is redeploying wounded soldiers to the front lines in Ukraine by force before they can complete medical treatment, Telegram channel Ostorozhno, Novosti reported this week.", "language": "English", "datePublished": "2024-12-06T17:14:12+03:00", "dateModified": "2024-12-08T20:07:56+03:00", "content": "Dear readers, We are facing unprecedented challenges. Russia's Prosecutor General's Office has designated The Moscow Times as an \"undesirable\" organization, criminalizing our work and putting our staff at risk of prosecution. This follows our earlier unjust labeling as a \"foreign agent.\" These actions are direct attempts to silence independent journalism in Russia. The authorities claim our work \"discredits the decisions of the Russian leadership.\" We see things differently: we strive to provide accurate, unbiased reporting on Russia. We, the journalists of The Moscow Times, refuse to be silenced. But to continue our work,  .  It's quick to set up, and every contribution makes a significant impact. By supporting The Moscow Times, you're defending open, independent journalism in the face of repression. Thank you for standing with us.", "publisher": {"name": "The Moscow Times", "logo": "https://static.themoscowtimes.com/img/logo.png"}, "author": "The Moscow Times", "images": ["https://static.themoscowtimes.com/image/og/40/87252__4041a5c6e01add72b0642227c815672a.jpg"], "keywords": ["Ukraine war,Army"]},
{"url": "https://www.themoscowtimes.com/2024/12/06/putin-drops-demand-for-gas-payments-via-gazprombank-a87251", "crawled_from": "The Moscow Times", "title": "Putin Drops Demand for Gas Payments Via Gazprombank", "description": "Russian President Vladimir Putin has scrapped an order for foreign buyers of Russian gas to pay through Gazprombank, which was hit with U.S. sanctions last month.", "language": "English", "datePublished": "2024-12-06T16:02:12+03:00", "dateModified": "2024-12-08T20:05:18+03:00", "content": "Dear readers, We are facing unprecedented challenges. Russia's Prosecutor General's Office has designated The Moscow Times as an \"undesirable\" organization, criminalizing our work and putting our staff at risk of prosecution. This follows our earlier unjust labeling as a \"foreign agent.\" These actions are direct attempts to silence independent journalism in Russia. The authorities claim our work \"discredits the decisions of the Russian leadership.\" We see things differently: we strive to provide accurate, unbiased reporting on Russia. We, the journalists of The Moscow Times, refuse to be silenced. But to continue our work,  .  It's quick to set up, and every contribution makes a significant impact. By supporting The Moscow Times, you're defending open, independent journalism in the face of repression. Thank you for standing with us.", "publisher": {"name": "The Moscow Times", "logo": "https://static.themoscowtimes.com/img/logo.png"}, "author": "The Moscow Times", "images": ["https://static.themoscowtimes.com/image/og/c8/87251__c8e8ec965471b6458de2c10826c483fd.jpg"], "keywords": ["Gazprom,Gas,Sanctions"]},
{"url": "https://www.themoscowtimes.com/2024/12/06/russian-economy-shows-signs-of-slowdown-top-banker-warns-a87250", "crawled_from": "The Moscow Times", "title": "Russian Economy Shows Signs of Slowdown, Top Banker Warns", "description": " The Russian economy is showing \"significant\" signs of a slowdown in some sectors as it grapples with waning growth and high inflation, the head of the country's biggest lender warned Friday.", "language": "English", "datePublished": "2024-12-06T14:42:31+03:00", "dateModified": "2024-12-08T20:05:17+03:00", "content": "The Russian economy is showing \"significant\" signs of a slowdown in some sectors as it grapples with waning growth and high inflation, the head of the country's biggest lender warned Friday. Russia's Central Bank has taken interest rates to a two-decade high of 21% as Moscow battles to stem the economic fallout from its invasion of Ukraine and a barrage of Western sanctions. Inflation is running at more than twice the government's 4% target, in part due to huge spending on the war, while the value of the ruble has slumped in recent months. \"We are now seeing significant signals of economic slowdown, particularly in housing construction and investment,\" German Gref, the CEO of state-run Sberbank, was quoted as saying by Russian news agencies at an investor forum. He cautioned the Central Bank against \"overshooting\" its rates policy, making it \"harder to return to the rails of economic growth.\" The regulator is set to decide on borrowing costs at a meeting on Dec. 20, with some analysts suggesting the Bank could hike interest rates to as high as 23%. Russia has massively ramped up military spending on its invasion of Ukraine — an expenditure that has helped the economy defy predictions of a lengthy recession but also led to deep labor shortages and persistent inflation. Central Bank Governor Elvira Nabiullina has called interest rates a \"powerful instrument for the fight with inflation.\" But economists say that because inflation is being driven by record state spending on the war in Ukraine, higher borrowing costs have less of an impact on reining in price rises than in a more market-based economy. Dear readers, We are facing unprecedented challenges. Russia's Prosecutor General's Office has designated The Moscow Times as an \"undesirable\" organization, criminalizing our work and putting our staff at risk of prosecution. This follows our earlier unjust labeling as a \"foreign agent.\" These actions are direct attempts to silence independent journalism in Russia. The authorities claim our work \"discredits the decisions of the Russian leadership.\" We see things differently: we strive to provide accurate, unbiased reporting on Russia. We, the journalists of The Moscow Times, refuse to be silenced. But to continue our work,  .  It's quick to set up, and every contribution makes a significant impact. By supporting The Moscow Times, you're defending open, independent journalism in the face of repression. Thank you for standing with us.", "publisher": {"name": "The Moscow Times", "logo": "https://static.themoscowtimes.com/img/logo.png"}, "author": "AFP", "images": ["https://static.themoscowtimes.com/image/og/5a/87250__5a4ba26837c549a54a3099f9ca81d6a7.jpg"], "keywords": ["Sberbank,Economy"]},
{"url": "https://www.themoscowtimes.com/2024/12/06/russians-in-syria-urged-to-leave-country-a87254", "crawled_from": "The Moscow Times", "title": "Russians in Syria Urged to Leave Country", "description": "Russian citizens who live in Syria should flee the lightning Islamist-led rebel offensive using any available commercial passenger flights, the Russian Embassy in Damascus said Friday. “The Russian Embassy in Damascus reminds Russian citizens living in the SAR [Syrian Arab Republic] of the possibility of leaving the country using commercial flights through operating airports,” it said.", "language": "English", "datePublished": "2024-12-06T18:06:57+03:00", "dateModified": "2024-12-08T20:14:15+03:00", "content": "Dear readers, We are facing unprecedented challenges. Russia's Prosecutor General's Office has designated The Moscow Times as an \"undesirable\" organization, criminalizing our work and putting our staff at risk of prosecution. This follows our earlier unjust labeling as a \"foreign agent.\" These actions are direct attempts to silence independent journalism in Russia. The authorities claim our work \"discredits the decisions of the Russian leadership.\" We see things differently: we strive to provide accurate, unbiased reporting on Russia. We, the journalists of The Moscow Times, refuse to be silenced. But to continue our work,  .  It's quick to set up, and every contribution makes a significant impact. By supporting The Moscow Times, you're defending open, independent journalism in the face of repression. Thank you for standing with us.", "publisher": {"name": "The Moscow Times", "logo": "https://static.themoscowtimes.com/img/logo.png"}, "author": "The Moscow Times", "images": ["https://static.themoscowtimes.com/image/og/a0/87254__a03915052367d6091625a24342738233.jpg"], "keywords": ["Syria"]},
{"url": "https://www.themoscowtimes.com/2024/12/06/putin-says-belarus-could-host-oreshnik-missile-in-2025-a87256", "crawled_from": "The Moscow Times", "title": "Putin Says Belarus Could Host Oreshnik Missile in 2025", "description": "Russia could deploy its nuclear-capable hypersonic ballistic missile Oreshnik in Belarus late next year, President Vladimir Putin said Friday. “It will become possible, I think, in the second half of next year, as the serial production of these complexes is ramped up in Russia,” he said in a televised meeting with Belarusian President Alexander Lukashenko.", "language": "English", "datePublished": "2024-12-06T19:18:41+03:00", "dateModified": "2024-12-08T20:10:09+03:00", "content": "Dear readers, We are facing unprecedented challenges. Russia's Prosecutor General's Office has designated The Moscow Times as an \"undesirable\" organization, criminalizing our work and putting our staff at risk of prosecution. This follows our earlier unjust labeling as a \"foreign agent.\" These actions are direct attempts to silence independent journalism in Russia. The authorities claim our work \"discredits the decisions of the Russian leadership.\" We see things differently: we strive to provide accurate, unbiased reporting on Russia. We, the journalists of The Moscow Times, refuse to be silenced. But to continue our work,  .  It's quick to set up, and every contribution makes a significant impact. By supporting The Moscow Times, you're defending open, independent journalism in the face of repression. Thank you for standing with us.", "publisher": {"name": "The Moscow Times", "logo": "https://static.themoscowtimes.com/img/logo.png"}, "author": "The Moscow Times", "images": ["https://static.themoscowtimes.com/image/og/f8/87256__f884933c7e787c88d6533904e64e5f66.jpg"], "keywords": ["Oreshnik,missile"]},
{"url": "https://www.themoscowtimes.com/2024/12/06/fact-check-tucker-carlson-interviews-russian-foreign-minister-sergei-lavrov-a87253", "crawled_from": "The Moscow Times", "title": "Fact-Check: Tucker Carlson Interviews Russian Foreign Minister Sergei Lavrov\n", "description": "Controversial right-wing personality Tucker Carlson returned to Russia to interview Foreign Minister Sergei Lavrov following a high-profile interview with President Vladimir Putin in February.", "language": "English", "datePublished": "2024-12-06T19:56:00+03:00", "dateModified": "2024-12-08T20:07:15+03:00", "content": "Dear readers, We are facing unprecedented challenges. Russia's Prosecutor General's Office has designated The Moscow Times as an \"undesirable\" organization, criminalizing our work and putting our staff at risk of prosecution. This follows our earlier unjust labeling as a \"foreign agent.\" These actions are direct attempts to silence independent journalism in Russia. The authorities claim our work \"discredits the decisions of the Russian leadership.\" We see things differently: we strive to provide accurate, unbiased reporting on Russia. We, the journalists of The Moscow Times, refuse to be silenced. But to continue our work,  .  It's quick to set up, and every contribution makes a significant impact. By supporting The Moscow Times, you're defending open, independent journalism in the face of repression. Thank you for standing with us.", "publisher": {"name": "The Moscow Times", "logo": "https://static.themoscowtimes.com/img/logo.png"}, "author": "Charlie Hancock", "images": ["https://static.themoscowtimes.com/image/og/f6/87253__f6848aa079dfb21cc526aee2dffef2f6.jpg"], "keywords": ["Tucker Carlson,Lavrov"]},
{"url": "https://www.themoscowtimes.com/2024/12/08/zelensky-says-kyiv-wants-enduring-peace-to-protect-it-from-russia-a87263", "crawled_from": "The Moscow Times", "title": "Zelensky Says Kyiv Wants 'Enduring' Peace To Protect it From Russia\n", "description": "Ukrainian leader Volodymyr Zelensky said Sunday he told US President-elect Donald Trump Kyiv needed an \"enduring\" peace that Russia will not \"destroy\" in the future, after they met in Paris for talks on the almost three-year war.", "language": "English", "datePublished": "2024-12-08T21:04:00+03:00", "dateModified": "2024-12-08T20:04:06+03:00", "content": "Dear readers, We are facing unprecedented challenges. Russia's Prosecutor General's Office has designated The Moscow Times as an \"undesirable\" organization, criminalizing our work and putting our staff at risk of prosecution. This follows our earlier unjust labeling as a \"foreign agent.\" These actions are direct attempts to silence independent journalism in Russia. The authorities claim our work \"discredits the decisions of the Russian leadership.\" We see things differently: we strive to provide accurate, unbiased reporting on Russia. We, the journalists of The Moscow Times, refuse to be silenced. But to continue our work,  .  It's quick to set up, and every contribution makes a significant impact. By supporting The Moscow Times, you're defending open, independent journalism in the face of repression. Thank you for standing with us.", "publisher": {"name": "The Moscow Times", "logo": "https://static.themoscowtimes.com/img/logo.png"}, "author": "AFP", "images": ["https://static.themoscowtimes.com/image/og/24/87263__24ec55c15b300e5ba36639a3e4251821.jpg"], "keywords": [""]},
{"url": "https://www.themoscowtimes.com/2024/12/07/turkey-russia-and-iran-meet-in-doha-seeking-exit-from-syria-chaos-a87258", "crawled_from": "The Moscow Times", "title": "Turkey, Russia and Iran Meet in Doha Seeking Exit From Syria Chaos", "description": "Turkey's foreign minister will meet with his Russian and Iranian counterparts in Doha on Saturday to try to find a solution to the renewed fighting in Syria and avoid chaos on its doorstep.", "language": "English", "datePublished": "2024-12-07T14:32:01+03:00", "dateModified": "2024-12-08T20:04:41+03:00", "content": "Dear readers, We are facing unprecedented challenges. Russia's Prosecutor General's Office has designated The Moscow Times as an \"undesirable\" organization, criminalizing our work and putting our staff at risk of prosecution. This follows our earlier unjust labeling as a \"foreign agent.\" These actions are direct attempts to silence independent journalism in Russia. The authorities claim our work \"discredits the decisions of the Russian leadership.\" We see things differently: we strive to provide accurate, unbiased reporting on Russia. We, the journalists of The Moscow Times, refuse to be silenced. But to continue our work,  .  It's quick to set up, and every contribution makes a significant impact. By supporting The Moscow Times, you're defending open, independent journalism in the face of repression. Thank you for standing with us.", "publisher": {"name": "The Moscow Times", "logo": "https://static.themoscowtimes.com/img/logo.png"}, "author": "Anne Chaon for AFP", "images": ["https://static.themoscowtimes.com/image/og/f8/87258__f88bde2d4959ac12dffd4cb1f1cdeec5.jpg"], "keywords": ["Syria"]},
{"url": "https://www.themoscowtimes.com/2024/12/08/how-russia-is-reacting-to-the-downfall-of-syrias-assad-a87260", "crawled_from": "The Moscow Times", "title": "How Russia Is Reacting to the Downfall of Syria's Assad", "description": "Islamist-led rebels in Syria announced they had seized Damascus in a swift offensive on Sunday, forcing President Bashar al-Assad to flee the country and bringing an end to five decades of Baath rule in Syria.", "language": "English", "datePublished": "2024-12-08T14:28:00+03:00", "dateModified": "2024-12-08T20:08:22+03:00", "content": "The Russian Foreign Ministry said Sunday it was “closely following the dramatic events in Syria” and urged everyone “to refrain from using violence and resolve all issues through political means.” “As a result of recent negotiations between B. Assad and several participants in the armed conflict in the Syrian Arab Republic, he made the decision to resign from the presidency and leave the country, instructing a peaceful transfer of power,” the ministry said, adding that Moscow was not involved in the negotiations. Russia also said that it “is in contact with all factions of the Syrian opposition.” Dear readers, We are facing unprecedented challenges. Russia's Prosecutor General's Office has designated The Moscow Times as an \"undesirable\" organization, criminalizing our work and putting our staff at risk of prosecution. This follows our earlier unjust labeling as a \"foreign agent.\" These actions are direct attempts to silence independent journalism in Russia. The authorities claim our work \"discredits the decisions of the Russian leadership.\" We see things differently: we strive to provide accurate, unbiased reporting on Russia. We, the journalists of The Moscow Times, refuse to be silenced. But to continue our work,  .  It's quick to set up, and every contribution makes a significant impact. By supporting The Moscow Times, you're defending open, independent journalism in the face of repression. Thank you for standing with us.", "publisher": {"name": "The Moscow Times", "logo": "https://static.themoscowtimes.com/img/logo.png"}, "author": "The Moscow Times", "images": ["https://static.themoscowtimes.com/image/og/b8/87260__b871101b95bb8657a392b7c540b45b1a.jpg"], "keywords": ["Syria"]},
{"url": "https://www.themoscowtimes.com/2024/12/07/assad-ally-russia-says-terrorist-group-cannot-be-allowed-to-run-syria-a87259", "crawled_from": "The Moscow Times", "title": "Assad Ally Russia Says ‘Terrorist Group’ Cannot Be Allowed To Run Syria", "description": "Russian Foreign Minister Sergei Lavrov said Saturday that Syria must not be allowed to fall into the hands of a \"terrorist group\" as Islamist-led rebels advance on President Bashar al-Assad's seat of power.", "language": "English", "datePublished": "2024-12-07T19:45:02+03:00", "dateModified": "2024-12-08T20:07:17+03:00", "content": "Dear readers, We are facing unprecedented challenges. Russia's Prosecutor General's Office has designated The Moscow Times as an \"undesirable\" organization, criminalizing our work and putting our staff at risk of prosecution. This follows our earlier unjust labeling as a \"foreign agent.\" These actions are direct attempts to silence independent journalism in Russia. The authorities claim our work \"discredits the decisions of the Russian leadership.\" We see things differently: we strive to provide accurate, unbiased reporting on Russia. We, the journalists of The Moscow Times, refuse to be silenced. But to continue our work,  .  It's quick to set up, and every contribution makes a significant impact. By supporting The Moscow Times, you're defending open, independent journalism in the face of repression. Thank you for standing with us.", "publisher": {"name": "The Moscow Times", "logo": "https://static.themoscowtimes.com/img/logo.png"}, "author": "AFP", "images": ["https://static.themoscowtimes.com/image/og/34/87259__349a5062884c8bfd6f2100eb4368c68e.jpg"], "keywords": ["Syria"]},
{"url": "https://www.themoscowtimes.com/2024/12/08/bashar-al-assad-and-family-are-in-moscow-russian-news-agencies-a87264", "crawled_from": "The Moscow Times", "title": "Bashar al-Assad And Family Are in Moscow: Russian News Agencies", "description": "Syria's ousted president Bashar al-Assad and his family are in Moscow, Russian news agencies announced Sunday evening citing a Kremlin source, hours after he fled the country as Islamist-led rebels entered Damascus.", "language": "English", "datePublished": "2024-12-08T21:14:00+03:00", "dateModified": "2024-12-08T20:09:10+03:00", "content": "Syria's ousted president Bashar al-Assad and his family are in Moscow, Russian news agencies announced Sunday evening citing a Kremlin source, hours after he fled the country as Islamist-led rebels entered Damascus. \"Assad and members of his family have arrived in Moscow,\" the source told the TASS and Ria Novosti news agencies. \"Russia granted them asylum on humanitarian grounds,\" he added. Dear readers, We are facing unprecedented challenges. Russia's Prosecutor General's Office has designated The Moscow Times as an \"undesirable\" organization, criminalizing our work and putting our staff at risk of prosecution. This follows our earlier unjust labeling as a \"foreign agent.\" These actions are direct attempts to silence independent journalism in Russia. The authorities claim our work \"discredits the decisions of the Russian leadership.\" We see things differently: we strive to provide accurate, unbiased reporting on Russia. We, the journalists of The Moscow Times, refuse to be silenced. But to continue our work,  .  It's quick to set up, and every contribution makes a significant impact. By supporting The Moscow Times, you're defending open, independent journalism in the face of repression. Thank you for standing with us.", "publisher": {"name": "The Moscow Times", "logo": "https://static.themoscowtimes.com/img/logo.png"}, "author": "The Moscow Times", "images": ["https://static.themoscowtimes.com/image/og/b7/87264__b77bda36111ce7024a4a0f781f081d36.jpg"], "keywords": [""]},
{"url": "https://www.themoscowtimes.com/2024/12/08/trump-says-zelensky-is-ready-for-deal-with-russia-a87261", "crawled_from": "The Moscow Times", "title": "Trump Says Zelensky is Ready for 'Deal' With Russia", "description": "U.S.", "language": "English", "datePublished": "2024-12-08T14:41:00+03:00", "dateModified": "2024-12-08T20:14:22+03:00", "content": "Dear readers, We are facing unprecedented challenges. Russia's Prosecutor General's Office has designated The Moscow Times as an \"undesirable\" organization, criminalizing our work and putting our staff at risk of prosecution. This follows our earlier unjust labeling as a \"foreign agent.\" These actions are direct attempts to silence independent journalism in Russia. The authorities claim our work \"discredits the decisions of the Russian leadership.\" We see things differently: we strive to provide accurate, unbiased reporting on Russia. We, the journalists of The Moscow Times, refuse to be silenced. But to continue our work,  .  It's quick to set up, and every contribution makes a significant impact. By supporting The Moscow Times, you're defending open, independent journalism in the face of repression. Thank you for standing with us.", "publisher": {"name": "The Moscow Times", "logo": "https://static.themoscowtimes.com/img/logo.png"}, "author": "AFP", "images": ["https://static.themoscowtimes.com/image/og/2c/87261__2c33074208be3a91d1757aaced2fb4b3.jpg"], "keywords": [""]}]
